kirikak2/midori/sdkconfig.defaults.m5stack_tab5
# M5Stack Tab5 specific settings (ESP32-P4)
# CONFIG_USB_MIDI_BOARD_FREENOVE is not set
# CONFIG_USB_MIDI_BOARD_M5STACK_CORES3 is not set
CONFIG_USB_MIDI_BOARD_M5STACK_TAB5=y

# Target: ESP32-P4 (RISC-V dual-core 400MHz)
CONFIG_IDF_TARGET="esp32p4"

# Enable experimental features (required for 200MHz PSRAM)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Custom partition table
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM configuration for Tab5 (32MB PSRAM in Hex mode)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# PSRAM speed MUST be 200MHz for Tab5 display (1280x720)
# CONFIG_SPIRAM_SPEED_80M is not set
# CONFIG_SPIRAM_SPEED_20M is not set
CONFIG_SPIRAM_SPEED_200M=y

# Use PSRAM for memory allocation
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Compiler optimization for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# USB Host settings for USB-A port (MIDI host)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096

# USB Host power management
# Disable USB suspend to prevent disconnection issues
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

# Tab5 display settings (1280x720, landscape mode)
# Font size 3 for better readability on high-DPI 5-inch screen
CONFIG_USB_MIDI_LCD_FONT_SIZE=4
CONFIG_USB_MIDI_LCD_BACKLIGHT_LEVEL=200

# Tab5 has both USB-C (device/serial) and USB-A (host)
# USB-C is now a TinyUSB composite device (CDC + MIDI).
# NOTE: CONFIG_ESP_CONSOLE_USB_CDC is NOT available for ESP32-P4 (only S2/S3),
# so the secondary USB-Serial-JTAG console is disabled instead. The USB-C
# connector itself is handed to TinyUSB at runtime by swapping the FSLS PHY
# mux (usb_serial_jtag_ll_phy_select) in picoruby-usb_midi_device; console
# output is then redirected to USB CDC via tinyusb_console_init().
# NOTE: Hardware JTAG debugging via USB-C is no longer available, and
# idf.py flash now requires entering download mode manually (BOOT + RESET).
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# TinyUSB device stack for the USB-C FS OTG port
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_MIDI_COUNT=1

# Enable mbedtls CMAC support for PicoRuby
CONFIG_MBEDTLS_CMAC_C=y

# Brownout detection level
# Level 5 (2.66V) - lowest level to prevent false triggers during USB operation
# Tab5 with USB-A host can cause significant voltage drops under load
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7 is not set
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y
CONFIG_ESP_BROWNOUT_DET_LVL=5
